# Точка входа пользователя

# 0. Начало работы, запуск апи цбрф о валютах и проверка если файл есть, то загрузить иначе получить по апи
# 1. Ввод работадателей (компаний), которые интересны пользователю
# 2. Предложение об последюущих опциях

# 3.1 Вывести список компаний и кол-во активных вакансий
# 3.2 Вывести среднюю зп по ВСЕМ вакансиям

# 4. Список всех вакансий: название, компания, зп, ссылка
# 5. Список вакансий у которых зп выше чем средняя из всего списка
# 6. Список вакансий у которых в названии есть ключевые слова пользователя

# 7. После выполнения пунктов 4-6 предлагать вывести в консоль или сохранить в файл
# 8. После выполенния пунктов 3.1 - 3.2 выводить результат в консоль

